harmon25/AtomVM/src/platforms/esp32/components/avm_builtins/network_driver.c
    esp_netif_t *sta_wifi_interface = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    esp_netif_t *ap_wifi_interface = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");

    // Disconnect STA if connected to access point
    if ((sta_wifi_interface != NULL) && (esp_netif_is_netif_up(sta_wifi_interface))) {
        esp_err_t err = esp_wifi_disconnect();
        if (UNLIKELY(err == ESP_FAIL)) {
            ESP_LOGE(TAG, "ESP FAIL error while disconnecting from AP, continuing network shutdown...");
        }
    }

    // Stop and deinit the WiFi driver, these only return OK, or not init error (fine to ignore).
    esp_wifi_stop();
    esp_wifi_deinit();

    // Stop sntp (ignore OK, or not configured error)
    esp_sntp_stop();

    // Destroy existing netif interfaces
    if (ap_wifi_interface != NULL) {
        esp_netif_destroy_default_wifi(ap_wifi_interface);
    }
    if (sta_wifi_interface != NULL) {
        esp_netif_destroy_default_wifi(sta_wifi_interface);
    }
}

static term authmode_to_atom(GlobalContext *global, wifi_auth_mode_t authmode)
{
    switch (authmode) {
        case WIFI_AUTH_OPEN:
            return make_atom(global, open_atom);
        case WIFI_AUTH_WEP:
            return make_atom(global, wep_atom);
        case WIFI_AUTH_WPA_PSK:
            return make_atom(global, wpa_psk_atom);
        case WIFI_AUTH_WPA2_PSK:
            return make_atom(global, wpa2_psk_atom);
        case WIFI_AUTH_WPA_WPA2_PSK:
            return make_atom(global, wpa_wpa2_psk_atom);
        case WIFI_AUTH_WPA2_ENTERPRISE:
            return make_atom(global, wpa2_enterprise_atom);
        case WIFI_AUTH_WPA3_PSK:
            return make_atom(global, wpa3_psk_atom);
        case WIFI_AUTH_WPA2_WPA3_PSK:
            return make_atom(global, wpa2_wpa3_psk_atom);
        case WIFI_AUTH_WAPI_PSK:
            return make_atom(global, wapi_psk_atom);
        default:
            return make_atom(global, open_atom);
    }
}

static void scan_wifi(Context *ctx, term pid, term ref)
{
    // Start WiFi scan
    wifi_scan_config_t scan_config = {
        .ssid = NULL,
        .bssid = NULL,
        .channel = 0,
        .show_hidden = true,
        .scan_type = WIFI_SCAN_TYPE_ACTIVE
    };

    esp_err_t err = esp_wifi_scan_start(&scan_config, true); // blocking scan
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "WiFi scan failed to start: %d", err);
        size_t tuple_reply_size = PORT_REPLY_SIZE + TUPLE_SIZE(2);
        port_ensure_available(ctx, tuple_reply_size);
        term error = port_create_error_tuple(ctx, term_from_int(err));
        port_send_reply(ctx, pid, ref, error);
        return;
    }

    // Get scan results
    uint16_t ap_count = 0;
    esp_wifi_scan_get_ap_num(&ap_count);
    
    if (ap_count == 0) {
        // Return empty list
        size_t tuple_reply_size = PORT_REPLY_SIZE + TUPLE_SIZE(2);
        port_ensure_available(ctx, tuple_reply_size);
        term empty_list = term_nil();
        term reply = port_create_tuple2(ctx, OK_ATOM, empty_list);
        port_send_reply(ctx, pid, ref, reply);
        return;
    }

    // Limit to 50 APs max
    if (ap_count > 50) {
        ap_count = 50;
    }

    wifi_ap_record_t *ap_records = malloc(sizeof(wifi_ap_record_t) * ap_count);
    if (ap_records == NULL) {
        ESP_LOGE(TAG, "Failed to allocate memory for scan results");
        size_t tuple_reply_size = PORT_REPLY_SIZE + TUPLE_SIZE(2);
        port_ensure_available(ctx, tuple_reply_size);
        term error = port_create_error_tuple(ctx, OUT_OF_MEMORY_ATOM);
        port_send_reply(ctx, pid, ref, error);
        return;
    }

    err = esp_wifi_scan_get_ap_records(&ap_count, ap_records);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "Failed to get scan records: %d", err);
        free(ap_records);
        size_t tuple_reply_size = PORT_REPLY_SIZE + TUPLE_SIZE(2);
        port_ensure_available(ctx, tuple_reply_size);
        term error = port_create_error_tuple(ctx, term_from_int(err));
        port_send_reply(ctx, pid, ref, error);
        return;
    }

    // Estimate heap size needed for response
    // Each AP: map (approx 8 + 4*2 per entry) + ssid binary + bssid binary
    size_t estimated_size = PORT_REPLY_SIZE + TUPLE_SIZE(2) + (ap_count * (TERM_MAP_SIZE(4) + 128));
    
    if (UNLIKELY(memory_ensure_free(ctx, estimated_size) != MEMORY_GC_OK)) {
        ESP_LOGE(TAG, "Failed to allocate heap for scan results");
        free(ap_records);
        size_t tuple_reply_size = PORT_REPLY_SIZE + TUPLE_SIZE(2);
        port_ensure_available(ctx, tuple_reply_size);
        term error = port_create_error_tuple(ctx, OUT_OF_MEMORY_ATOM);
        port_send_reply(ctx, pid, ref, error);
        return;
    }

    // Build list of AP info maps
    term ap_list = term_nil();
    for (int i = ap_count - 1; i >= 0; i--) {
        wifi_ap_record_t *ap = &ap_records[i];
        
        // Create SSID binary
        size_t ssid_len = strnlen((char *)ap->ssid, 33);
        term ssid_bin = term_from_literal_binary(ap->ssid, ssid_len, &ctx->heap, ctx->global);
        
        // Create BSSID binary (6 bytes MAC address)
        term bssid_bin = term_from_literal_binary(ap->bssid, 6, &ctx->heap, ctx->global);
        
        // Create authmode atom
        term authmode = authmode_to_atom(ctx->global, ap->authmode);
        
        // Create map with AP info
        term ap_map = term_alloc_map(4, &ctx->heap);
        term_set_map_assoc(ap_map, 0, make_atom(ctx->global, ssid_atom), ssid_bin);
        term_set_map_assoc(ap_map, 1, make_atom(ctx->global, bssid_atom), bssid_bin);
        term_set_map_assoc(ap_map, 2, make_atom(ctx->global, ATOM_STR("\x4", "rssi")), term_from_int(ap->rssi));
        term_set_map_assoc(ap_map, 3, make_atom(ctx->global, channel_atom), term_from_int(ap->primary));
        
        // Add authmode as 5th entry
        term ap_map_with_auth = term_alloc_map(5, &ctx->heap);
        term_set_map_assoc(ap_map_with_auth, 0, make_atom(ctx->global, ssid_atom), ssid_bin);
        term_set_map_assoc(ap_map_with_auth, 1, make_atom(ctx->global, bssid_atom), bssid_bin);
        term_set_map_assoc(ap_map_with_auth, 2, make_atom(ctx->global, ATOM_STR("\x4", "rssi")), term_from_int(ap->rssi));
        term_set_map_assoc(ap_map_with_auth, 3, make_atom(ctx->global, channel_atom), term_from_int(ap->primary));
        term_set_map_assoc(ap_map_with_auth, 4, make_atom(ctx->global, authmode_atom), authmode);
        
